app/Controllers/Pages.php

    public function index()
    {
        $today = (new DateTimeImmutable('now', new DateTimeZone('Asia/Manila')))
            ->format('Y-m-d');

        $taskModel = new TaskModel();

        return view('pages/welcome', [
            'tasks' => $taskModel
                ->where('task_date', $today)
                ->findAll(),
        ]);
---
SELECT *
FROM `tasks`
WHERE `task_date` = '2026-09-27'

    public function tasks()
    {
        $taskModel = new TaskModel();

        return view('pages/tasks', [
            'tasks' => $taskModel
                ->orderBy('task_date', 'ASC')
                ->orderBy('id', 'ASC')
                ->findAll(),
        ]);
---
SELECT *
FROM `tasks`
ORDER BY `task_date` ASC, `id` ASC

    public function profile()
    {
        $userModel = new UserModel();

        return view('pages/profile', [
            'user' => $userModel->first(),
        ]);
---
SELECT *
FROM `users`
 LIMIT 1